<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of IAELPA 21 secure browser</string>
    <key>Identifier</key>
    <string>com.github.nfv.download.IAELPA21</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ELPA21</string>
        <key>SEARCH_URL</key>
        <string>https://iowaelpa21.portal.cambiumast.com/secure-browsers.stml</string>
        <key>DOWNLOAD_URL</key>
        <string>https://files.portal.cambiumast.com/SecureTest/SecureBrowsers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\SB([0-9]{4})</string>
                <key>result_output_var_name</key>
                <string>FOLDER</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\SecureTest([0-9]{2}\.[0-9]\-[0-9]{4}\-[0-9]{2}\-[0-9]{2})</string>
                <key>result_output_var_name</key>
                <string>FILE</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/SB%FOLDER%/SecureTest%FILE%-signed.dmg</string>
                <key>filename</key>
                <string>SecureTest%FILE%-signed.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>