<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of IAELPA 21 secure browser</string>
    <key>Identifier</key>
    <string>com.github.nfv.download.IAELPA21</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ELPA21</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://files\.portal\.cambiumast\.com/SecureTest/SecureBrowsers/SB[0-9]{4}/SecureTest[0-9]{2}\.[0-9]\-[0-9]{4}\-[0-9]{2}\-[0-9]{2}\-signed\.dmg</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://iowaelpa21.portal.cambiumast.com/Supported_Browsers/Iowa/Content/Portal_OSs/Sec_Browsers/macOS.htm</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>