<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe for Auralia Cloud from risingsoftware.com. Must supply school code.</string>
	<key>Identifier</key>
	<string>com.github.nfv.download.musicfirst.auralia</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>auralia</string>
		<key>SCHOOL_CODE</key>
		<string></string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.risingsoftware.com/cloudsupport/downloads</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>https:\/\/download\.risingsoftware\.com\/desktop\/v[0-9]\/[0-9]\.[0-9]\.[0-9]\.[0-9]\/auralia_m_[0-9]\.[0-9]\.[0-9]\.[0-9]_cloud\.pkg</string>
					<key>result_output_var_name</key>
					<string>url</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%?schoolcode=%SCHOOL_CODE%</string>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
